#!/bin/bash
source export GROQ_API_KEY=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
# Affichage de l'heure et du mode de développement

# Définition des variables utilisées dans le script:
hudTensor="╔╗╚╝═║╠╣╦╩╬"         # Caractères spéciaux utilisés pour le design du menu
SCRIPT_DIR="./Users/universmc/.module_zsh"  # Répertoire contenant les scripts à exécuter

# Définition de la fonction 'menu' pour afficher le menu avec les options:

menu() {
    echo ""
    echo " ╔═══════════════════════════════════════╗       ╔═══════════════════════════════════════════════════════════════════════════╗";
    echo " ╠════════════ ✨ Pi Console ════════════╣       ║  [💫] [✨] [🧘] [📚] [🌌] [💬] [∏] [💰] [🌴] [📱] [💻] [📡]<         >[🛰]║";
    echo " ║                                       ║       ╠═══════════════════════════════════════════════════════════════════════════╣";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ║                                       ║       ║                                                                           ║";
    echo " ╠═══════════════════════════════════════╣       ╠═══════════════════════════════════════════════════════════════════════════╣";
    echo " ║(PS1)<                              /%>║       ║[PS2]:/<                                                                /%>║";
    echo " ╚═══════════════════════════════════════╝       ╚═══════════════════════════════════════════════════════════════════════════╝"
    echo ""

}

menu  # Appel de la fonction pour afficher le menu
